//环境文本

function EnvHint(text,color){
    this.text = text
    this.color = color
}

const wakeUp1 = new EnvHint("铁栅栏间透过些微亮光，走廊上的尘灰在光中飞舞，你从一夜睡梦中清醒过来，面对牢房四周冰冷而坚硬的砖墙。","gray")
const wakeUp2 = new EnvHint("夜晚在沉寂中一点点流逝，你在冻得发硬的被褥中醒来，手背无意间触碰到床沿冰冷的支架，刺骨的冰寒触感将刚才还沉浸在梦境的余韵中的你一下子拉拽回现实。","gray")
const wakeUp3 = new EnvHint("你睁开眼睛，入目是紧贴着床沿的石墙，铅灰色的砖墙在缝隙中隐隐渗透出苔藓的青绿色。一股带着霉味的潮湿气息钻入鼻腔，你发觉自己依旧处在这间低矮的、逼仄的、闷热的牢房内，时刻被令人窒息的沉重氛围包裹着。","gray")
const wakeUp4 = new EnvHint("你自然而然地清醒了，心里却不清楚被自己唤醒的理由，心底曾经存在的热情都留在了昨日，今天的晨间似乎只是又一次苦痛循环的开始。好像花朵应该生发在土层中，而你生来就是监狱的囚犯。","gray")
const insomnia1 = new EnvHint("铅灰色的地板，冰冷的铁制栅栏，监狱阴冷的气息顺着呼吸钻入胸腔，牵扯出心底躁动着的某种情绪。你在牢狱内又开始了新的一天，灯芯的焦糊气味挥之不去，目光所及的一切景象都如此地令人憎恶。","gray")
const insomnia2 = new EnvHint("墙上的液晶屏幕泛着黯淡的光泽，绿色的枝绦从电视屏幕的外侧垂落下去，昨夜烛灯的残骸被弃置在桌面上。一夜过去，你看到牢房内仍是一成不变的景象，空气中没有朝日的活力，只是安静得令人心慌。","gray")
const insomnia3 = new EnvHint("监牢本身不会传达任何情感，但你仍旧能从牢房的布设中感受到深切的恶意，在每一个你怅然若失的清晨，在每一个你麻木不仁的清晨，在每一个你永矢弗谖的清晨，这份恶意从来不曾离你而去。","gray")
const wakeUpMajolize1 = new EnvHint("你从床上坐起，意识到监狱的清晨未曾有过宁静祥和的时刻，但牢房内的不净、不洁、不详对你而言都失去了意义，身体对外界的感知不再明晰，躯体的活动像是僵硬的人偶，只有内心深处如同熔岩一般的憎恶与仇恨一刻不停地翻腾着，几乎化作实质的疯狂不断从中喷涌而出。","red")
const wakeUpMajolize2 = new EnvHint("即便在梦境中不得安宁，你也不知道自己为什么自己醒来之后会如此用力地抓握住床沿的支架，或许是意图从金属的冰寒中求取内心的宁静，或许你仅仅只是顺从了自己毁灭的欲望，冷硬的金属支架和少女柔软白皙的脖颈在你眼里并无二致。","red")
const insomniaMajolize1 = new EnvHint("在这间牢房面前，一切关于魔法的浪漫遐想都失去了光彩，即便是全新的一天，但死亡的阴影和危险的冲动仍纠缠着你，脑内止不住地传来刺痛感，身体沉重地难以活动，痛切、孤独与莫大的悲怆时刻伴随着你，如影随形。","red")
const insomniaMajolize2 = new EnvHint("光中飞舞的尘埃在视野中一点点模糊，你知道这意味着又一个清晨的来临，但你再不能像从前一样迎接崭新的开始了。恍惚间，模糊不清的画面中出现了生者与逝者的身影，但你同样不能再清晰地将他们区分开来，某种狂暴的、灼烫的意志驱动着你的躯体，鼓动着你将束缚着身心的枷锁全部砸个粉碎。","red")

global.wakeUpText = [wakeUp1,wakeUp2,wakeUp3,wakeUp4]
global.insomniaText = [insomnia1,insomnia2,insomnia3]
global.wakeUpMajolizeText = [wakeUpMajolize1,wakeUpMajolize2]
global.insomniaMajolizeText = [insomniaMajolize1,insomniaMajolize2]

const curfew1 = new EnvHint("和个人意愿无关，只要打算遵守监狱的规则，你每天晚上就势必会再次回到这间环境恶劣的牢房里，每天看着走廊砖瓦的铅灰色一点点被青苔的暗绿色浸染，自身也不可抑制地一点点向深渊滑落。","gray")
const curfew2 = new EnvHint("监狱充斥着沉寂的时刻来临，一天的活动遗留下的疲惫感和日渐增长的心理压力在内心深处相互粘合，令人感到恶心的情感翻涌而上，透过铁栅栏的缝隙，你像是能看到那个内心深处隐秘而危险的自我站在另一侧，望向你的神情中带着十足的厌恶与憎恨。","gray")
const curfew3 = new EnvHint("一天过去了，这间牢房依旧维持着令人生厌的模样，尽管外面有更加舒适宜居的房间，但监狱的规则难以违背，各种激烈的情绪和欲望都在一天的活动后归于沉沦，只余下满溢身心的疲惫。","gray")
const curfew4 = new EnvHint("在回到你与这间监牢初遇的地点之后，你或许会回忆起白天在窗外一瞥而见的百合花苞，或许会回想起白天与和你处境相似的少女们脸上各异的神情，或许会追忆着更久远的过往，尽管那不一定是你愿意回想起来的事。但无论你有着怎样不为人知的思绪，时间也只是兀自迈步向前。","gray")
const curfew5 = new EnvHint("每一天都有结束的时刻，刻骨铭心的过往却难以因此而淡化。当又一次静谧的时刻来临，你迫于黑暗点燃牢房内的烛台，整日经历的点滴不由自主地浮现在脑海中，烛火沉默着晃开一圈又一圈的光晕，将你的影子照在冷色的砖墙上。","gray")
const curfew6 = new EnvHint("铁栅栏门上锁时，金属刮蹭的声音有些刺耳，在高墙内的世界，每一天经历的都是类似的影像。这所监牢好似要把它的秘密和你的梦想一同埋葬，让少女的躯体被永远囚禁在救赎无望的境地。","gray")
const curfewMajolize1 = new EnvHint("这座监狱的夜晚是静寂的，烛火在墙上映照出细长的影子。烛光晃荡着，暗影也挣扎着、扭曲着在墙面上印出极尽怪诞的形状；烛光愈加微弱，整间牢房的内壁也愈被暗影吞噬；在烛火熄灭的瞬间，潮水般涌来的惊惧与癫狂将你完全吞没在黑暗之中。","red")
const curfewMajolize2 = new EnvHint("身处这座监牢中，慰藉与希冀只是药物般的消耗品。过去的时间流逝殆尽，当下的时间正在流逝，而未来的时间永远不会来临。在分秒的流逝中，来自他人言语中的恶意，时刻身处死亡威胁之中的恐惧，不知未来将要去往何方的惊慌，种种情绪与希望糅合在一起，将祈愿中的未来扭曲成千万种陌生的模样。","red")
const curfewMajolize3 = new EnvHint("监狱内的一日落下帷幕，一天内的一切遭遇都只是这所牢狱充满着恶意的一环，而你只能在这样的舞台上充当提线木偶，参与进永无止尽的循环中，沉溺在难以自拔的绝望里，直到自身也真正成为这所监狱的恶意的一部分为止。","red")

global.curfewText = [curfew1,curfew2,curfew3,curfew4,curfew5,curfew6]
global.curfewMajolizeText = [curfewMajolize1,curfewMajolize2,curfewMajolize3]

const stayOut1 = new EnvHint("魔女岛上听不见生物活动的声响，监视着高墙的鹰群们时刻收敛着自己的行动，鲜花生长的原野和浮萍游荡的湖泊，一切似乎都无言地诉说着某个遥远而悲伤的故事。","gray")
const stayOut2 = new EnvHint("月光洒落在魔女岛上，你看见殷紫色的花海随风摇动，成片地和白色的星点般的花束交相点缀，洒落在渺远的田野上，和监狱建筑的森严冰冷相比，魔女岛上的景色四处流露着朴素的诗意之美。","gray")
const stayOut3 = new EnvHint("在牢狱之外，你能窥见一部分这座岛真实的模样。岛上的夜晚星光璀璨，朝空中远望的视线几乎不会受到任何遮挡，你看见夜空的幽蓝深邃，白色的光点集群闪烁，从入目的夜景中，属于遥远银河的绚烂与神秘触手可及。","gray")
const stayOut4 = new EnvHint("站在高墙的这一侧，墙后的大海只能存在于你的臆想之中。大树的枝叶摩挲着，细微、轻柔的声音混杂在延绵不绝的海潮声中，恍惚间，你听见千万缕消逝在风中的少女的歌声。","gray")
const stayOut5 = new EnvHint("在除了魔女岛之外的其他地方，你从未见过这样透亮的月光，空中衍射而成的月华流淌着神圣的乳白色，照亮着数十人合抱之粗的巨木。那树木的高度同样是你生平仅见，树冠沐浴着月华的洗礼向上生长着，像是要承载住整片夜空如水一般的温柔。","gray")

global.stayOutText = [stayOut1,stayOut2,stayOut3,stayOut4,stayOut5]